In [ ]:
a = 3

In [4]:
a = 4
a

4

In [5]:
a

4

In [6]:
pip install pandas

Collecting pandasNote: you may need to restart the kernel to use updated packages.

  Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.2.1-cp313-cp313-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\pc-2\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\pc-2\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
   ---------------------------------------- 0.0/11.5 MB ? eta -:--:--
   ---- ----------------------------------- 1.3/11.5 MB 7.0 MB/s eta 0:00:02
   --------- ------------------------------ 2.6/11.5 MB 7.3 MB/s eta 0:00:02
   ---------------- ----------------------- 4.7/11.5 MB 7.9 MB/s eta 0:00:01
   ---------------------- ----------------- 6.6/11.5 MB 8.1 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.5 MB 7.8 MB/s eta 0:00:01
   ----------------------------- ---------- 8.4/11.5 MB 6.8 MB/s eta 0:00:01
   ----------------------------------- ---- 10.2/11.5 MB 7.2 MB/s eta 0:00:01
   ---------------------------------------- 11.5/11.5 MB 7.1 MB/s eta 0:00:00
Downloading numpy-2.2.1-cp313-cp313-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ----- ---------------------------------- 1.8/12.6 MB 9.9 MB/s eta 0:00:02
   --------- ------------------------------ 3.1/12.6 MB 8.3 MB/s eta 0:00:02
   -------------- ------------------------- 4.5/12.6 MB 7.1 MB/s eta 0:00:02
   ------------------- -------------------- 6.3/12.6 MB 7.8 MB/s eta 0:00:01
   --------------------------- ------------ 8.7/12.6 MB 8.3 MB/s eta 0:00:01
   ------------------------------ --------- 9.7/12.6 MB 7.9 MB/s eta 0:00:01
   --------------------------------- ------ 10.5/12.6 MB 7.2 MB/s eta 0:00:01
   ------------------------------------- -- 11.8/12.6 MB 7.0 MB/s eta 0:00:01
   ---------------------------------------  12.6/12.6 MB 7.1 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 6.4 MB/s eta 0:00:00
Downloading pytz-2024.2-py2.py3-none-any.whl (508 kB)
Downloading tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.2.1 pandas-2.2.3 pytz-2024.2 tzdata-2024.2

In [2]:
import pandas as pd

In [62]:
data = pd.read_csv('experience_salary_data.csv')

In [63]:
data

     year of experience       salary
0              1.239182  52478.36470
1             13.425406  76850.81296
2             12.811853  75623.70519
3              7.162558  64325.11549
4             10.168967  70337.93413
..                  ...          ...
495           19.341608  88683.21617
496            1.605911  53211.82206
497           15.882086  81764.17171
498           15.550100  81100.20088
499            5.099850  60199.69952

[500 rows x 2 columns]

In [64]:
data.round()

     year of experience   salary
0                   1.0  52478.0
1                  13.0  76851.0
2                  13.0  75624.0
3                   7.0  64325.0
4                  10.0  70338.0
..                  ...      ...
495                19.0  88683.0
496                 2.0  53212.0
497                16.0  81764.0
498                16.0  81100.0
499                 5.0  60200.0

[500 rows x 2 columns]

In [65]:
data.head()

   year of experience       salary
0            1.239182  52478.36470
1           13.425406  76850.81296
2           12.811853  75623.70519
3            7.162558  64325.11549
4           10.168967  70337.93413

In [66]:
data.tail()

     year of experience       salary
495           19.341608  88683.21617
496            1.605911  53211.82206
497           15.882086  81764.17171
498           15.550100  81100.20088
499            5.099850  60199.69952

In [67]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year of experience  500 non-null    float64
 1   salary              500 non-null    float64
dtypes: float64(2)
memory usage: 7.9 KB

In [30]:
data.isna().sum()

year of experience    0
salary                0
dtype: int64

In [31]:
data.describe()

       year of experience        salary
count          500.000000    500.000000
mean            10.884437  71768.873618
std              5.541345  11082.689968
min              1.004539  52009.078380
25%              6.335433  62670.866450
50%             11.117777  72235.554030
75%             15.881748  81763.496148
max             19.983918  89967.835930

In [22]:
data = {
    "name": ["Lion", "Monkey", "Hymenshu", "Panda", "Deer", "Cobra", "Tiger",
             "Elephant", "Giraffe", "Zebra", "Kangaroo", "Rabbit", "Fox",
             "Wolf", "Bear"],
    "category": ["Mammal", "Mammal", "Human", "Mammal", "Mammal", "Reptile", "Mammal",
                 "Mammal", "Mammal", "Mammal", "Mammal", "Mammal", "Mammal",
                 "Mammal", "Mammal"],
    "weight": [190, 35, 70, 90, 60, 12, 220, 5000, 1200, 350, 85, 2, 7, 80, 300],
}

df = pd.DataFrame(data)
print(df)
df.dtypes

        name category  weight
0       Lion   Mammal     190
1     Monkey   Mammal      35
2   Hymenshu    Human      70
3      Panda   Mammal      90
4       Deer   Mammal      60
5      Cobra  Reptile      12
6      Tiger   Mammal     220
7   Elephant   Mammal    5000
8    Giraffe   Mammal    1200
9      Zebra   Mammal     350
10  Kangaroo   Mammal      85
11    Rabbit   Mammal       2
12       Fox   Mammal       7
13      Wolf   Mammal      80
14      Bear   Mammal     300

name        object
category    object
weight       int64
dtype: object

In [21]:
import random

In [38]:
unique_animal_id = random.sample(range(10, 50), 3)

In [32]:
unique_animal_id

[30, 41, 36]

In [55]:
newData = { "rollNo": unique_animal_id, "name" : ["Lion", "IS", "KING"], "marks": [25, 65, 89] }

newDF = pd.DataFrame(newData)
newDF

   rollNo  name  marks
0      34  Lion     25
1      44    IS     65
2      31  KING     89

In [56]:
newDF.to_csv("animal.csv", index=False)

In [57]:
newDF['rollNo'] = pd.to_numeric(newDF["rollNo"])

In [59]:
newDF.drop(columns=["marks"])

   rollNo  name
0      34  Lion
1      44    IS
2      31  KING

In [58]:
copyNewDF = newDF

In [60]:
copyNewDF

   rollNo  name  marks
0      34  Lion     25
1      44    IS     65
2      31  KING     89